/******************************************************************************
 * 文件名: Code
 * 作者: BOLUN XU
 * 创建日期: 2025
 * 版本: 1.0
 * 描述: 丑数。
 * 时间复杂度： O(Logn)
 * 空间复杂度： O(1)
 ******************************************************************************/
class Solution {
public:
    bool isUgly(int n) {
        if (n > 0) {
            while (n % 5 == 0) {
                n /= 5;
            }
            while (n % 3 == 0) {
                n /= 3;
            }
            if ((n & (n - 1)) == 0) {
                return true;
            }
        }
        return false;
    }
};